wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  while (processed < max_pulses && popPulse(pulse)) {
    processed++;
    if (hidProx_.pushPulse(pulse.level != 0, pulse.durationUs, h10301, generic, hid_info)) {
      if (hid_info.h10301) {
        String id = F("FC=");
        id += String(h10301.facility);
        id += F(" CN=");
        id += String(h10301.card);
        id += F(" RAW=");
        id += hexBytes(h10301.raw, sizeof(h10301.raw), true);
        emitCard("LF", "HID-H10301", id);
        lastH10301_ = h10301;
        haveLastH10301_ = true;
        lastH10301EmitMs_ = millis();
      } else if (hid_info.generic) {
        if (generic.bit_size == 26 && haveLastH10301_ && (millis() - lastH10301EmitMs_) < 250UL) {
          continue;
        }
        String id = String(generic.bit_size);
        id += F("-bit ");
        id += hexBytes(generic.data, sizeof(generic.data), true);
        emitCard("LF", "HIDProx", id);
      }
    }
  }
}

bool NetworkRfidReader::setupHf() {
  if (hfReady_) {
    return true;
  }

  releaseHf();

  if (config_.pins.hfMode >= 0) {
    pinMode(config_.pins.hfMode, OUTPUT);
    digitalWrite(config_.pins.hfMode, config_.pins.hfModeLevel);
  }

  if (config_.pins.hfReset >= 0) {
    const uint8_t inactive = config_.pins.hfResetActiveLow ? HIGH : LOW;
    const uint8_t active = config_.pins.hfResetActiveLow ? LOW : HIGH;
    pinMode(config_.pins.hfReset, OUTPUT);
    digitalWrite(config_.pins.hfReset, inactive);
    delay(5);
    digitalWrite(config_.pins.hfReset, active);
    delay(5);
    digitalWrite(config_.pins.hfReset, inactive);
    delay(20);
  }

  if (config_.pins.hfIrq >= 0) {
    pinMode(config_.pins.hfIrq, INPUT);
  }

  if (config_.pins.hfBusMode == NetworkRfidHfBusMode::I2c) {
    if (config_.pins.hfSck < 0 || config_.pins.hfMiso < 0 || config_.pins.hfIrq < 0) {
      if (console_ != nullptr) {
        console_->println(F("HF I2C init failed: SCL/SDA/IRQ pin disabled"));
      }
      return false;
    }
    i2c_ = &Wire;
    i2c_->begin(config_.pins.hfMiso, config_.pins.hfSck, config_.hfI2cHz);
    delay(20);
    hfReader_ = new RfalRfST25R3916Class(i2c_, config_.pins.hfIrq);
  } else {
    if (config_.pins.hfCs < 0) {
      if (console_ != nullptr) {
        console_->println(F("HF SPI init failed: CS pin disabled"));
      }
      return false;
    }
    pinMode(config_.pins.hfCs, OUTPUT);
    digitalWrite(config_.pins.hfCs, HIGH);
    spi_ = new SPIClass(config_.pins.hfSpiBus);
    hfReader_ = new RfalRfST25R3916Class(spi_, config_.pins.hfCs, config_.pins.hfIrq, config_.hfSpiHz);
    spi_->begin(config_.pins.hfSck, config_.pins.hfMiso, config_.pins.hfMosi, config_.pins.hfCs);
  }

  nfc_ = new RfalNfcClass(hfReader_);

  const ReturnCode err = nfc_->rfalNfcInitialize();
  if (err != ERR_NONE) {
    if (console_ != nullptr) {
      console_->print(F("HF init failed: "));
      console_->println(static_cast<int>(err));
    }
    releaseHf();
    return false;
  }

  return true;
}

bool NetworkRfidReader::probeHfIdentity() {
  if (console_ != nullptr) {
    console_->print(F("HF probe bus="));
    console_->print(hfBusModeName(config_.pins.hfBusMode));
    console_->print(F(" SCK/SCL="));
    console_->print(config_.pins.hfSck);
    console_->print(F(" MOSI="));
    console_->print(config_.pins.hfMosi);
    console_->print(F(" MISO/SDA="));
    console_->print(config_.pins.hfMiso);
    console_->print(F(" CS="));
    console_->print(config_.pins.hfCs);
    console_->print(F(" IRQ="));
    console_->print(config_.pins.hfIrq);
    console_->print(F(" SPI="));
    console_->print(config_.hfSpiHz);
    console_->print(F(" I2C="));
    console_->println(config_.hfI2cHz);
  }

  if (config_.pins.hfBusMode == NetworkRfidHfBusMode::Spi && config_.pins.hfCs < 0) {
    if (console_ != nullptr) {
      console_->println(F("HF probe failed: CS pin disabled"));
    }
    return false;
  }

  if (config_.pins.hfMode >= 0) {
    pinMode(config_.pins.hfMode, OUTPUT);
    digitalWrite(config_.pins.hfMode, config_.pins.hfModeLevel);
  }

  if (config_.pins.hfReset >= 0) {
    const uint8_t inactive = config_.pins.hfResetActiveLow ? HIGH : LOW;
    const uint8_t active = config_.pins.hfResetActiveLow ? LOW : HIGH;
    pinMode(config_.pins.hfReset, OUTPUT);
    digitalWrite(config_.pins.hfReset, inactive);
    delay(5);
    digitalWrite(config_.pins.hfReset, active);
    delay(5);
    digitalWrite(config_.pins.hfReset, inactive);
    delay(20);
  }

  if (config_.pins.hfIrq >= 0) {
    pinMode(config_.pins.hfIrq, INPUT);
  }

  if (config_.pins.hfBusMode == NetworkRfidHfBusMode::I2c) {
    if (config_.pins.hfSck < 0 || config_.pins.hfMiso < 0 || config_.pins.hfIrq < 0) {
      if (console_ != nullptr) {
        console_->println(F("HF probe failed: SCL/SDA/IRQ pin disabled"));
      }
      return false;
    }
    Wire.begin(config_.pins.hfMiso, config_.pins.hfSck, config_.hfI2cHz);
    delay(20);
    Wire.beginTransmission(0x50);
    const uint8_t ack = static_cast<uint8_t>(Wire.endTransmission(true));
    if (console_ != nullptr) {
      console_->print(F("HF I2C empty-write ACK 0x50="));
      console_->println(static_cast<int>(ack));
    }
    RfalRfST25R3916Class probe_reader(&Wire, config_.pins.hfIrq);

    uint8_t id = 0;
    const ReturnCode err = probe_reader.st25r3916ReadRegister(ST25R3916_REG_IC_IDENTITY, &id);

    const uint8_t type = id & ST25R3916_REG_IC_IDENTITY_ic_type_mask;
    const uint8_t rev = id & ST25R3916_REG_IC_IDENTITY_ic_rev_mask;
    const bool match = (type == ST25R3916_REG_IC_IDENTITY_ic_type_st25r3916 ||
                        type == ST25R3916_REG_IC_IDENTITY_ic_type_st25r3916b);

    if (console_ != nullptr) {
      console_->print(F("HF probe err="));
      console_->print(static_cast<int>(err));
      console_->print(F(" identity=0x"));
      if (id < 0x10) {
        console_->print('0');
      }
      console_->print(id, HEX);
      console_->print(F(" type=0x"));
      if (type < 0x10) {
        console_->print('0');
      }
      console_->print(type, HEX);
      console_->print(F(" rev="));
      console_->print(rev);
      console_->print(F(" match="));
      console_->println(match ? F("yes") : F("no"));
    }

    return (err == ERR_NONE) && match;
  }

