wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  hfReader_->rfalWorker();
  bool data_flag = false;
  rfalBitRate last_br = RFAL_BR_106;
  const rfalLmState state = hfReader_->rfalListenGetState(&data_flag, &last_br);
  if (state != hfLastLmState_) {
    hfLastLmState_ = state;
    if (console_ != nullptr) {
      console_->print(F("HF card state="));
      console_->println(hfLmStateName(state));
    }
  }

  if (data_flag && hfListenRxBits_ > 0) {
    const size_t rx_bytes = (hfListenRxBits_ + 7U) / 8U;
    if (!handleHfCardListenFrame(hfListenRxBuf_, rx_bytes)) {
      emitCard("HF", "CARD-RX", hexBytes(hfListenRxBuf_, rx_bytes, true));
      hfReader_->rfalListenSetState(state);
    }
  }
}

void NetworkRfidReader::resetHfCardProtocol() {
  hfLastLmState_ = RFAL_LM_STATE_NOT_INIT;
  hfListenRxBits_ = 0;
  hfCardIsoDepActive_ = false;
  hfCardExpectedBlock_ = 0;
  hfCardSelectedFile_ = kT4tFileNone;
  hfCardTxLen_ = 0;
  hfCardLastTxLen_ = 0;
}

bool NetworkRfidReader::handleHfCardListenFrame(const uint8_t* data, size_t length) {
  if (data == nullptr || length < 2U || data[0] != 0xE0U) {
    return false;
  }

  const uint8_t ats[] = {
    0x05,  // TL
    0x78,  // FSCI=8, TA/TB/TC present
    0x00,  // 106 kbps only
    0x80,  // FWI=8, SFGI=0
    0x00,  // no DID/NAD
  };

  hfCardIsoDepActive_ = true;
  hfCardExpectedBlock_ = 0;
  hfCardSelectedFile_ = kT4tFileNone;
  hfReader_->rfalListenSetState(RFAL_LM_STATE_CARDEMU_4A);

  if (console_ != nullptr) {
    console_->print(F("HF card RATS -> ATS field="));
    console_->println(hfReader_->rfalIsExtFieldOn() ? F("on") : F("off"));
  }
  return sendHfCardIsoDepFrame(ats, sizeof(ats), true);
}

void NetworkRfidReader::serviceHfCardIsoDep() {
  hfReader_->rfalWorker();
  const ReturnCode ret = hfReader_->rfalGetTransceiveStatus();
  if (ret == ERR_BUSY) {
    return;
  }

  if (ret != ERR_NONE) {
    if (console_ != nullptr && ret != ERR_TIMEOUT) {
      console_->print(F("HF card ISO-DEP stopped: "));
      console_->println(static_cast<int>(ret));
    }
    hfCardEmulationActive_ = false;
    resetHfCardProtocol();
    lastHfCardEmuAttemptMs_ = 0;
    startHfCardEmulation();
    return;
  }

  const size_t rx_bytes = (hfListenRxBits_ + 7U) / 8U;
  if (!handleHfCardIsoDepFrame(hfListenRxBuf_, rx_bytes)) {
    hfCardEmulationActive_ = false;
    resetHfCardProtocol();
    lastHfCardEmuAttemptMs_ = 0;
    startHfCardEmulation();
  }
}

bool NetworkRfidReader::handleHfCardIsoDepFrame(const uint8_t* frame, size_t length) {
  if (frame == nullptr || length == 0U) {
    return false;
  }

  const uint8_t pcb = frame[0];

  if ((pcb & kIsoDepPcbTypeMask) == 0xC0U) {
    if ((pcb & 0xF0U) == (kIsoDepPcbWtx & 0xF0U)) {
      const uint8_t wtxm = (length > 1U) ? frame[1] : 1U;
      uint8_t response[] = {kIsoDepPcbWtx, wtxm};
      return sendHfCardIsoDepFrame(response, sizeof(response), true);
    }

    uint8_t response[] = {kIsoDepPcbDeselect};
    sendHfCardIsoDepFrame(response, sizeof(response), false);
    hfCardEmulationActive_ = false;
    resetHfCardProtocol();
    lastHfCardEmuAttemptMs_ = 0;
    startHfCardEmulation();
    return true;
  }

  if ((pcb & kIsoDepPcbRBlockMask) == 0x80U) {
    if (hfCardLastTxLen_ > 0U) {
      return sendHfCardIsoDepFrame(hfCardLastTxBuf_, hfCardLastTxLen_, true);
    }
    uint8_t rack[] = {static_cast<uint8_t>(kIsoDepPcbRBlock | (hfCardExpectedBlock_ & kIsoDepPcbBlockNumber))};
    return sendHfCardIsoDepFrame(rack, sizeof(rack), true);
  }

  if ((pcb & kIsoDepPcbTypeMask) != 0x00U) {
    return false;
  }

  const uint8_t rxBlock = (pcb & kIsoDepPcbBlockNumber);
  if (rxBlock != hfCardExpectedBlock_ && hfCardLastTxLen_ > 0U) {
    return sendHfCardIsoDepFrame(hfCardLastTxBuf_, hfCardLastTxLen_, true);
  }

  size_t infPos = 1;
  if ((pcb & 0x08U) != 0U) {
    infPos++;
  }
  if ((pcb & 0x04U) != 0U) {
    infPos++;
  }
  if (infPos > length) {
    return false;
  }

  if ((pcb & kIsoDepPcbChaining) != 0U) {
    hfCardExpectedBlock_ ^= 1U;
    uint8_t rack[] = {static_cast<uint8_t>(kIsoDepPcbRBlock | (hfCardExpectedBlock_ & kIsoDepPcbBlockNumber))};
    return sendHfCardIsoDepFrame(rack, sizeof(rack), true);
  }

  const size_t apduLen = length - infPos;
  const size_t respLen = buildHfT4tApduResponse(&frame[infPos], apduLen, &hfCardTxBuf_[1], sizeof(hfCardTxBuf_) - 1U);
  if (respLen == 0U) {
    return false;
  }

  hfCardTxBuf_[0] = static_cast<uint8_t>(kIsoDepPcbIBlock | rxBlock);
  hfCardExpectedBlock_ = rxBlock ^ 1U;
  return sendHfCardIsoDepFrame(hfCardTxBuf_, respLen + 1U, true);
}

bool NetworkRfidReader::sendHfCardIsoDepFrame(const uint8_t* frame, size_t length, bool expectRx) {
  if (hfReader_ == nullptr || frame == nullptr || length == 0U || length > sizeof(hfCardTxBuf_)) {
    return false;
  }

  memcpy(hfCardLastTxBuf_, frame, length);
  hfCardLastTxLen_ = static_cast<uint16_t>(length);
  hfListenRxBits_ = 0;

  const ReturnCode err = hfReader_->rfalTransceiveBlockingTx(const_cast<uint8_t*>(frame),
                                                             static_cast<uint16_t>(length),
                                                             expectRx ? hfListenRxBuf_ : nullptr,
                                                             expectRx ? static_cast<uint16_t>(sizeof(hfListenRxBuf_) * 8U) : 0,
                                                             expectRx ? &hfListenRxBits_ : nullptr,
                                                             RFAL_TXRX_FLAGS_DEFAULT,
                                                             RFAL_FWT_NONE);
  if (err != ERR_NONE) {
    if (console_ != nullptr) {
      console_->print(F("HF card TX failed: "));
      console_->println(static_cast<int>(err));
    }
    return false;
  }

  return true;
}

size_t NetworkRfidReader::buildHfNdefMessage(uint8_t* out, size_t maxLength) const {
  if (out == nullptr || maxLength == 0U) {
    return 0;
  }

  size_t pos = 0;
  if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Url) {
    const String payload = config_.hfCardPayload.length() > 0 ? config_.hfCardPayload : String(F("https://www.elechouse.com/"));
    const size_t payloadLen = 1U + static_cast<size_t>(payload.length());
    if (!appendNdefHeader(out, maxLength, pos, 0x01, 1, payloadLen) ||
        !appendByte(out, maxLength, pos, 'U') ||
        !appendByte(out, maxLength, pos, 0x00) ||
        !appendStringBytes(out, maxLength, pos, payload)) {
      return 0;
    }
    return pos;
  }

  if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Vcard) {
    const char mime[] = "text/vcard";
    const size_t payloadLen = static_cast<size_t>(config_.hfCardPayload.length());
    if (!appendNdefHeader(out, maxLength, pos, 0x02, static_cast<uint8_t>(strlen(mime)), payloadLen) ||
        !appendBytes(out, maxLength, pos, reinterpret_cast<const uint8_t*>(mime), strlen(mime)) ||
        !appendStringBytes(out, maxLength, pos, config_.hfCardPayload)) {
      return 0;
    }
    return pos;
  }

  String payload;
  if (config_.hfCardPayloadType == NetworkRfidHfCardPayloadType::Wifi) {
    payload = F("WIFI:T:WPA;S:");
    payload += config_.hfCardWifiSsid;
    payload += F(";P:");
    payload += config_.hfCardWifiPassword;
    payload += F(";;");
  } else {
    payload = config_.hfCardPayload;
  }

  const size_t payloadLen = 3U + static_cast<size_t>(payload.length());
  if (!appendNdefHeader(out, maxLength, pos, 0x01, 1, payloadLen) ||
      !appendByte(out, maxLength, pos, 'T') ||
      !appendByte(out, maxLength, pos, 0x02) ||
      !appendByte(out, maxLength, pos, 'e') ||
      !appendByte(out, maxLength, pos, 'n') ||
      !appendStringBytes(out, maxLength, pos, payload)) {
    return 0;
  }
  return pos;
}

size_t NetworkRfidReader::buildHfNdefFile(uint8_t* out, size_t maxLength) const {
  if (out == nullptr || maxLength < 2U) {
    return 0;
  }

  const size_t ndefLen = buildHfNdefMessage(&out[2], maxLength - 2U);
  if (ndefLen == 0U || ndefLen > 0xFFFEU) {
    return 0;
  }

  out[0] = static_cast<uint8_t>((ndefLen >> 8) & 0xFFU);
  out[1] = static_cast<uint8_t>(ndefLen & 0xFFU);
  return ndefLen + 2U;
}

size_t NetworkRfidReader::buildHfT4tApduResponse(const uint8_t* apdu, size_t apduLen, uint8_t* out, size_t maxLength) {
  if (apdu == nullptr || out == nullptr || maxLength < 2U || apduLen < 2U) {
    return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
  }

  const uint8_t ins = apdu[1];
  if (ins == 0xA4U) {
    if (apduLen < 5U) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    const uint8_t p1 = apdu[2];
    const uint8_t lc = apdu[4];
    if (apduLen < (5U + lc)) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    const uint8_t* data = &apdu[5];
    if (p1 == 0x04U) {
      if (lc == sizeof(kT4tNdefAid) && memcmp(data, kT4tNdefAid, sizeof(kT4tNdefAid)) == 0) {
        hfCardSelectedFile_ = kT4tFileNone;
        return appendStatus(out, maxLength, 0, kT4tSwSuccess);
      }
      return appendStatus(out, maxLength, 0, kT4tSwFileNotFound);
    }

    if (lc == 2U) {
      const uint16_t fileId = (static_cast<uint16_t>(data[0]) << 8) | data[1];
      if (fileId == kT4tCcFileId) {
        hfCardSelectedFile_ = kT4tFileCc;
        return appendStatus(out, maxLength, 0, kT4tSwSuccess);
      }
      if (fileId == kT4tNdefFileId) {
        hfCardSelectedFile_ = kT4tFileNdef;
        return appendStatus(out, maxLength, 0, kT4tSwSuccess);
      }
    }
    return appendStatus(out, maxLength, 0, kT4tSwFileNotFound);
  }

  if (ins == 0xB0U) {
    if (apduLen < 5U) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    const uint16_t offset = (static_cast<uint16_t>(apdu[2] & 0x7FU) << 8) | apdu[3];
    uint16_t le = apdu[4];
    if (le == 0U) {
      le = 256U;
    }

    const uint8_t* source = nullptr;
    size_t sourceLen = 0;
    if (hfCardSelectedFile_ == kT4tFileCc) {
      source = kT4tCcFile;
      sourceLen = sizeof(kT4tCcFile);
    } else if (hfCardSelectedFile_ == kT4tFileNdef) {
      sourceLen = buildHfNdefFile(hfCardNdefFile_, sizeof(hfCardNdefFile_));
      source = hfCardNdefFile_;
    } else {
      return appendStatus(out, maxLength, 0, kT4tSwConditionsNotSatisfied);
    }

