wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
    if (source == nullptr || sourceLen == 0U || offset > sourceLen) {
      return appendStatus(out, maxLength, 0, kT4tSwWrongParams);
    }

    size_t available = sourceLen - offset;
    size_t chunk = le < available ? le : available;
    const size_t room = maxLength - 2U;
    if (chunk > room) {
      chunk = room;
    }
    if (chunk > kT4tMaxReadChunk) {
      chunk = kT4tMaxReadChunk;
    }

    memcpy(out, &source[offset], chunk);
    return appendStatus(out, maxLength, chunk, kT4tSwSuccess);
  }

  return appendStatus(out, maxLength, 0, kT4tSwInsNotSupported);
}

bool NetworkRfidReader::beginHfDataExchange(rfalNfcDevice* device) {
  if (nfc_ == nullptr || device == nullptr || !isHfP2pDevice(device)) {
    return false;
  }

  String message = config_.hfP2pMessage;
  if (message.length() == 0) {
    message = F("ELECHOUSE RFID P2P");
  }

  const size_t tx_len = static_cast<size_t>(message.length()) > sizeof(hfP2pTxBuf_)
                            ? sizeof(hfP2pTxBuf_)
                            : static_cast<size_t>(message.length());
  memcpy(hfP2pTxBuf_, message.c_str(), tx_len);

  uint8_t* rx_data = nullptr;
  uint16_t* rx_len = nullptr;
  const ReturnCode err = nfc_->rfalNfcDataExchangeStart(hfP2pTxBuf_,
                                                        static_cast<uint16_t>(tx_len),
                                                        &rx_data,
                                                        &rx_len,
                                                        RFAL_FWT_NONE);
  if (err != ERR_NONE) {
    if (console_ != nullptr) {
      console_->print(F("HF P2P exchange start failed: "));
      console_->println(static_cast<int>(err));
    }
    return false;
  }

  hfDataExchangeActive_ = true;
  hfDiscoveryActive_ = false;
  hfExchangeRxData_ = rx_data;
  hfExchangeRxLen_ = rx_len;
  hfDataExchangeStartMs_ = millis();
  if (console_ != nullptr) {
    console_->print(F("HF P2P tx="));
    console_->println(message);
  }
  return true;
}

void NetworkRfidReader::serviceHfDataExchange() {
  if (!hfDataExchangeActive_ || nfc_ == nullptr) {
    return;
  }

  const ReturnCode err = nfc_->rfalNfcDataExchangeGetStatus();
  if (err == ERR_BUSY) {
    if ((millis() - hfDataExchangeStartMs_) > 5000UL) {
      if (console_ != nullptr) {
        console_->println(F("HF P2P exchange timeout"));
      }
      nfc_->rfalNfcDeactivate(true);
      hfDataExchangeActive_ = false;
      hfDiscoveryActive_ = true;
    }
    return;
  }

  if (err == ERR_NONE && hfExchangeRxData_ != nullptr && hfExchangeRxLen_ != nullptr) {
    const uint16_t rx_len = *hfExchangeRxLen_;
    String id = hexBytes(hfExchangeRxData_, rx_len, true);
    const String ascii = asciiPreview(hfExchangeRxData_, rx_len);
    if (ascii.length() > 0) {
      id += F(" ASCII=\"");
      id += ascii;
      id += '"';
    }
    emitCard("HF", "P2P-RX", id);
  } else if (console_ != nullptr) {
    console_->print(F("HF P2P exchange err="));
    console_->println(static_cast<int>(err));
  }

  nfc_->rfalNfcDeactivate(true);
  hfDataExchangeActive_ = false;
  hfExchangeRxData_ = nullptr;
  hfExchangeRxLen_ = nullptr;
  hfDiscoveryActive_ = true;
}

void NetworkRfidReader::handleSerial() {
  if (primaryConsole_ != nullptr) {
    handleSerialStream(*primaryConsole_, serialLine_);
  }
  if (hardwareUartReady_ && config_.hardwareUartCommands) {
    handleSerialStream(hardwareUart_, hardwareUartLine_);
  }
}

void NetworkRfidReader::handleSerialStream(Stream& stream, String& line) {
  while (stream.available() > 0) {
    const int value = stream.read();
    if (value < 0) {
      return;
    }
    const char c = static_cast<char>(value);
    if (c == '\r' || c == '\n') {
      line.trim();
      if (line.length() > 0) {
        Stream* previous_console = console_;
        console_ = &stream;
        handleCommand(line);
        console_ = previous_console;
      }
      line = "";
    } else if (c == '\b' || c == 0x7F) {
      if (line.length() > 0) {
        line.remove(line.length() - 1);
      }
    } else if (c >= 32 && c <= 126) {
      if (line.length() < 220) {
        line += c;
      } else {
        line = "";
      }
    }
  }
}

void NetworkRfidReader::handleCommand(String line) {
  String rest = line;
  const String cmd = lowerCopy(nextToken(rest));

  if (cmd == "help" || cmd == "h" || cmd == "?") {
    printHelp();
  } else if (cmd == "status" || cmd == "s") {
    printStatus();
  } else if (cmd == "pins") {
    printPins();
  } else if (cmd == "wifi") {
    handleWifiCommand(rest);
  } else if (cmd == "tcp") {
    handleTcpCommand(rest);
  } else if (cmd == "elechouse" || cmd == "eh" || cmd == "broker") {
    handleElechouseCommand(rest);
  } else if (cmd == "uart" || cmd == "serial1") {
    handleUartCommand(rest);
  } else if (cmd == "interface" || cmd == "iface" || cmd == "if") {
    handleInterfaceCommand(rest);
  } else if (cmd == "wiegand" || cmd == "wg") {
    rest = String(F("wiegand ")) + rest;
    handleInterfaceCommand(rest);
  } else if (cmd == "aba" || cmd == "clockdata") {
    rest = String(F("aba ")) + rest;
    handleInterfaceCommand(rest);
  } else if (cmd == "portal" || cmd == "ap") {
    handlePortalCommand(rest);
  } else if (cmd == "feedback" || cmd == "fb") {
    handleFeedbackCommand(rest);
  } else if (cmd == "button" || cmd == "key") {
    handleButtonCommand(rest);
  } else if (cmd == "format") {
    const String fmt = lowerCopy(nextToken(rest));
    if (fmt == "json") {
      config_.outputFormat = NetworkRfidOutputFormat::Json;
      console_->println(F("OK format=json"));
    } else if (fmt == "line" || fmt == "csv") {
      config_.outputFormat = NetworkRfidOutputFormat::CsvLine;
      console_->println(F("OK format=line"));
    } else {
      console_->println(F("ERR format json|line"));
    }
  } else if (cmd == "window" || cmd == "interval") {
    const uint32_t lf = nextToken(rest).toInt();
    const uint32_t hf = nextToken(rest).toInt();
    if (lf < 20 || hf < 20) {
      console_->println(F("ERR window <lf_ms> <hf_ms>, min 20"));
    } else {
      config_.lfWindowMs = lf;
      config_.hfWindowMs = hf;
      console_->println(F("OK window updated"));
    }
  } else if (cmd == "dedupe") {
    config_.duplicateSuppressMs = nextToken(rest).toInt();
    console_->println(F("OK dedupe updated"));
  } else if (cmd == "auto") {
    const String target = lowerCopy(nextToken(rest));
    const String value = lowerCopy(nextToken(rest));
    if ((target != "lf" && target != "hf") || (value != "on" && value != "off")) {
      console_->println(F("ERR auto lf|hf on|off"));
      return;
    }
    const bool enabled = value == "on";
    if (target == "lf") {
      config_.autoStartLf = enabled;
      if (enabled) {
        setActiveSlot(NetworkRfidSlot::LF);
      } else {
        setLfCapture(false);
        setLfCarrier(false);
        if (isHfEnabled()) {
          setActiveSlot(NetworkRfidSlot::HF);
        }
      }
    } else {
      config_.autoInitHf = enabled;
      if (enabled) {
        if (!hfReady_) {
          hfReady_ = setupHf();
        }
        if (hfReady_ && !isLfEnabled()) {
          setActiveSlot(NetworkRfidSlot::HF);
        }
      } else {
        releaseHf();
        if (isLfEnabled()) {
          setActiveSlot(NetworkRfidSlot::LF);
        }
      }
    }
    console_->println(F("OK auto updated"));
  } else if (cmd == "carrier") {
    const String mode = lowerCopy(nextToken(rest));
    if (mode == "on") {
      setLfCarrier(true);
    } else if (mode == "off") {
      setLfCarrier(false);
    } else {
      console_->println(F("ERR carrier on|off"));
      return;
    }
    printStatus();
  } else if (cmd == "pin") {
    handlePinCommand(rest);
  } else if (cmd == "lf") {
    handleLfCommand(rest);
  } else if (cmd == "hf") {
    handleHfCommand(rest);
  } else if (cmd == "save") {
    console_->println(saveConfig() ? F("OK saved") : F("ERR save failed"));
  } else if (cmd == "load") {
    console_->println(loadConfig() ? F("OK loaded, reboot recommended") : F("ERR no saved config"));
  } else if (cmd == "clear") {
    clearSavedConfig();
    console_->println(F("OK saved config cleared"));
  } else if (cmd == "reboot" || cmd == "restart") {
    console_->println(F("Rebooting"));
    delay(100);
    ESP.restart();
  } else if (cmd == "test") {
    emitCard("TEST", "SERIAL", String(F("12345678")));
  } else {
    console_->print(F("ERR unknown command: "));
    console_->println(cmd);
  }
}

void NetworkRfidReader::handleLfCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("LF carrier="));
    console_->print(lfCarrierEnabled_ ? F("on") : F("off"));
    console_->print(F(" freq="));
    console_->print(config_.lfCarrierHz);
    console_->print(F(" capture="));
    console_->print(lfCaptureEnabled_ ? F("on") : F("off"));
    console_->print(F(" hidBits="));
    console_->print(hidProx_.fskBitCount());
    console_->print(F(" slot="));
    console_->println(slotName(activeSlot_));
    return;
  }

  if (sub == "init" || sub == "start") {
    config_.autoStartLf = true;
    console_->println(F("LF init starting"));
    setLfCapture(false);
    setLfCarrier(false);
    slotStartMs_ = 0;
    setActiveSlot(NetworkRfidSlot::LF);
    console_->println(F("LF started"));
    return;
  }

  if (sub == "off" || sub == "stop") {
    config_.autoStartLf = false;
    setLfCapture(false);
    setLfCarrier(false);
    if (isHfEnabled()) {
      setActiveSlot(NetworkRfidSlot::HF);
    }
    console_->println(F("LF stopped"));
    return;
  }

  if (sub == "freq" || sub == "frequency") {
    const uint32_t hz = nextToken(rest).toInt();
    if (hz < 100000UL || hz > 150000UL) {
      console_->println(F("ERR lf freq <100000..150000>"));
      return;
    }
    const bool was_on = lfCarrierEnabled_;
    const bool was_capture_on = lfCaptureEnabled_;
    if (was_capture_on) {
      setLfCapture(false);
    }
    if (was_on) {
      setLfCarrier(false);
    }
    config_.lfCarrierHz = hz;
    if (was_on) {
      setLfCarrier(true);
    }
    if (was_capture_on) {
      setLfCapture(true);
    }
    console_->print(F("OK lf freq="));
    console_->println(config_.lfCarrierHz);
    return;
  }

  if (sub == "raw" || sub == "dump") {
    uint32_t count = nextToken(rest).toInt();
    if (count == 0) {
      count = 128;
    } else if (count > 512) {
      count = 512;
    }
    lfRawDumpRemaining_ = static_cast<uint16_t>(count);
    console_->print(F("OK lf raw count="));
    console_->println(lfRawDumpRemaining_);
    return;
  }

  if (sub == "scan") {
    handleLfScanCommand(rest);
    return;
  }

  if (sub == "indala") {
    handleLfIndalaCommand(rest);
    return;
  }

  if (sub == "hid") {
    handleLfHidCommand(rest);
    return;
  }

