wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  console_->println(F("ERR lf init|off|status|freq <hz>|scan [start stop step ms]|raw <count>|hid [ms]|indala [samples]"));
}

void NetworkRfidReader::handleLfHidCommand(String rest) {
  uint32_t duration_ms = nextToken(rest).toInt();
  if (duration_ms == 0) {
    duration_ms = 2000;
  } else if (duration_ms < 500) {
    duration_ms = 500;
  } else if (duration_ms > 8000) {
    duration_ms = 8000;
  }

  setLfCapture(false);
  hidProx_.reset();
  em4100_.reset();
  resetPulseQueue();
  stopHfDiscovery();
  if (config_.pins.lfPull >= 0) {
    digitalWrite(config_.pins.lfPull, LOW);
  }
  setLfCarrier(true);
  setLfCapture(true);
  activeSlot_ = NetworkRfidSlot::LF;
  slotStartMs_ = millis();

  console_->print(F("LF HID debug ms="));
  console_->println(duration_ms);

  const uint32_t start_ms = millis();
  uint32_t last_yield_ms = start_ms;
  while ((millis() - start_ms) < duration_ms) {
    processLfHidPulses(1024);
    const uint32_t now_ms = millis();
    if (now_ms != last_yield_ms) {
      delay(0);
      last_yield_ms = now_ms;
    }
  }
  processLfHidPulses(2048);

  uint32_t captured = 0;
  uint32_t dropped = 0;
  noInterrupts();
  captured = capturedPulses_;
  dropped = droppedPulses_;
  interrupts();

  char preview[105] = {};
  hidProx_.copyEncodedPreview(preview, sizeof(preview));
  const HidPulseFilterStats filter_stats = hidProx_.pulseFilterStats();
  const FskDemodStats fsk_stats = hidProx_.fskStats();
  console_->print(F("LF HID debug pulses="));
  console_->print(captured);
  console_->print(F(" dropped="));
  console_->print(dropped);
  console_->print(F(" filtered="));
  console_->print(filter_stats.filtered_pulses);
  console_->print(F(" merged="));
  console_->print(filter_stats.merged_same_level);
  console_->print(F(" glitches="));
  console_->print(filter_stats.dropped_glitches);
  console_->print(F(" longResets="));
  console_->print(filter_stats.long_resets);
  console_->print(F(" periods="));
  console_->print(fsk_stats.accepted_periods);
  console_->print(F(" lowP="));
  console_->print(fsk_stats.low_periods);
  console_->print(F(" highP="));
  console_->print(fsk_stats.high_periods);
  console_->print(F(" shortP="));
  console_->print(fsk_stats.rejected_short);
  console_->print(F(" longP="));
  console_->print(fsk_stats.rejected_long);
  console_->print(F(" recoveredP="));
  console_->print(fsk_stats.recovered_long);
  console_->print(F(" trans="));
  console_->print(fsk_stats.transitions);
  console_->print(F(" fskBits="));
  console_->print(hidProx_.fskBitCount());
  console_->print(F(" preview="));
  console_->println(preview);
}

void NetworkRfidReader::handleLfScanCommand(String rest) {
  if (config_.pins.lfAdc < 0) {
    console_->println(F("ERR lf adc pin disabled"));
    return;
  }

  uint32_t start_hz = nextToken(rest).toInt();
  uint32_t stop_hz = nextToken(rest).toInt();
  uint32_t step_hz = nextToken(rest).toInt();
  uint32_t sample_ms = nextToken(rest).toInt();
  if (start_hz == 0) {
    start_hz = 110000UL;
  }
  if (stop_hz == 0) {
    stop_hz = 135000UL;
  }
  if (step_hz == 0) {
    step_hz = 500UL;
  }
  if (sample_ms == 0) {
    sample_ms = 60UL;
  }

  if (start_hz < 80000UL || stop_hz > 160000UL || start_hz >= stop_hz ||
      step_hz < 100UL || step_hz > 10000UL || sample_ms < 10UL || sample_ms > 500UL) {
    console_->println(F("ERR lf scan [start stop step ms], hz 80000..160000"));
    return;
  }

  const uint32_t saved_hz = config_.lfCarrierHz;
  const bool saved_capture = lfCaptureEnabled_;
  const bool saved_carrier = lfCarrierEnabled_;
  if (saved_capture) {
    setLfCapture(false);
  }
  stopHfDiscovery();
  if (config_.pins.lfPull >= 0) {
    digitalWrite(config_.pins.lfPull, LOW);
  }

  console_->print(F("LF scan start="));
  console_->print(start_hz);
  console_->print(F(" stop="));
  console_->print(stop_hz);
  console_->print(F(" step="));
  console_->print(step_hz);
  console_->print(F(" ms="));
  console_->println(sample_ms);

  uint32_t best_hz = 0;
  uint16_t best_pp = 0;
  uint16_t best_min = 0;
  uint16_t best_max = 0;
  uint32_t best_avg = 0;

  for (uint32_t hz = start_hz; hz <= stop_hz; hz += step_hz) {
    if (lfCarrierEnabled_) {
      setLfCarrier(false);
    }
    config_.lfCarrierHz = hz;
    setLfCarrier(true);
    delay(25);

    uint16_t min_adc = 4095;
    uint16_t max_adc = 0;
    uint32_t sum = 0;
    uint32_t samples = 0;
    const uint32_t start_ms = millis();
    while ((millis() - start_ms) < sample_ms) {
      const uint16_t value = static_cast<uint16_t>(analogRead(config_.pins.lfAdc));
      if (value < min_adc) {
        min_adc = value;
      }
      if (value > max_adc) {
        max_adc = value;
      }
      sum += value;
      samples++;
      delayMicroseconds(13 + ((samples & 0x07U) * 7U));
    }

    const uint16_t pp = max_adc - min_adc;
    const uint32_t avg = samples == 0 ? 0 : sum / samples;
    console_->print(F("LFSCAN hz="));
    console_->print(hz);
    console_->print(F(" min="));
    console_->print(min_adc);
    console_->print(F(" max="));
    console_->print(max_adc);
    console_->print(F(" pp="));
    console_->print(pp);
    console_->print(F(" avg="));
    console_->println(avg);

    if (pp > best_pp) {
      best_hz = hz;
      best_pp = pp;
      best_min = min_adc;
      best_max = max_adc;
      best_avg = avg;
    }
  }

  if (lfCarrierEnabled_) {
    setLfCarrier(false);
  }
  config_.lfCarrierHz = saved_hz;
  if (saved_carrier || saved_capture) {
    setLfCarrier(true);
  }
  if (saved_capture) {
    setLfCapture(true);
  }

  console_->print(F("LFSCAN best hz="));
  console_->print(best_hz);
  console_->print(F(" min="));
  console_->print(best_min);
  console_->print(F(" max="));
  console_->print(best_max);
  console_->print(F(" pp="));
  console_->print(best_pp);
  console_->print(F(" avg="));
  console_->println(best_avg);
}

void NetworkRfidReader::handleLfIndalaCommand(String rest) {
  uint32_t requested = nextToken(rest).toInt();
  if (requested == 0) {
    requested = 20000;
  } else if (requested < 12000) {
    requested = 12000;
  } else if (requested > 60000) {
    requested = 60000;
  }

  IndalaId id = {};
  IndalaDecodeInfo info = {};
  size_t samples_read = 0;

  console_->print(F("LF Indala software capture samples="));
  console_->println(requested);

  if (!captureIndalaSamples(static_cast<uint16_t>(requested), id, info, samples_read)) {
    console_->print(F("ERR indala not decoded samples="));
    console_->print(samples_read);
    console_->print(F(" bits="));
    console_->print(info.bit_count);
    console_->print(F(" shifts="));
    console_->print(info.phase_shifts);
    console_->print(F(" halfUs="));
    console_->print(info.half_period_us);
    console_->print(F(" hist="));
    for (size_t i = 1; i < 16; i++) {
      if (info.pulse_hist[i] == 0) {
        continue;
      }
      console_->print(i);
      console_->print(':');
      console_->print(info.pulse_hist[i]);
      console_->print(' ');
    }
    if (info.bit_preview_len > 0) {
      console_->print(F("preview="));
      console_->print(info.bit_preview);
    }
    console_->println();
    return;
  }

  String card_id = F("FC=");
  card_id += String(id.facility);
  card_id += F(" CN=");
  card_id += String(id.card);
  card_id += F(" RAW=");
  card_id += hexBytes(id.raw, sizeof(id.raw), true);

  console_->print(F("OK indala samples="));
  console_->print(samples_read);
  console_->print(F(" bits="));
  console_->print(info.bit_count);
  console_->print(F(" start="));
  console_->print(info.frame_start);
  console_->print(F(" shifts="));
  console_->print(info.phase_shifts);
  console_->print(F(" halfUs="));
  console_->print(info.half_period_us);
  console_->print(F(" inverted="));
  console_->println(info.inverted ? F("yes") : F("no"));

  emitCard("LF", "Indala", card_id);
}

