wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  if (action == "reconnect" || action == "retry") {
    if (config_.wifiSsid.length() == 0) {
      console_->println(F("ERR wifi ssid is empty"));
      return;
    }
    restartStation();
    console_->println(F("OK wifi reconnecting"));
    return;
  }

  if (action == "scan") {
    const String target = rest;
    console_->println(F("WiFi scan starting"));
    const int count = WiFi.scanNetworks(false, true);
    console_->print(F("WiFi scan count="));
    console_->println(count);
    for (int i = 0; i < count; i++) {
      const String ssid = WiFi.SSID(i);
      if (target.length() > 0 && ssid != target) {
        continue;
      }
      console_->print(F("  ssid="));
      console_->print(ssid);
      console_->print(F(" rssi="));
      console_->print(WiFi.RSSI(i));
      console_->print(F(" ch="));
      console_->print(WiFi.channel(i));
      console_->print(F(" enc="));
      console_->println(static_cast<int>(WiFi.encryptionType(i)));
    }
    WiFi.scanDelete();
    return;
  }

  config_.wifiSsid = first;
  rest.trim();
  config_.wifiPassword = rest;
  restartStation();
  console_->println(F("OK wifi updated"));
}

void NetworkRfidReader::handleTcpCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));

  if (sub.length() == 0 || sub == "status") {
    console_->print(F("tcp mode="));
    console_->print(tcpModeName(config_.tcpMode));
    console_->print(F(" host="));
    console_->print(config_.tcpMode == NetworkRfidTcpMode::ElechouseTest ? String(kElechouseBrokerHost) : config_.tcpHost);
    console_->print(F(" port="));
    console_->print(config_.tcpMode == NetworkRfidTcpMode::ElechouseTest ? kElechouseBrokerPort : config_.tcpPort);
    console_->print(F(" listen="));
    console_->print(config_.tcpListenPort);
    console_->print(F(" echo="));
    console_->print(config_.tcpEchoEvents ? F("on") : F("off"));
    console_->print(F(" commands="));
    console_->print(config_.tcpCommands ? F("on") : F("off"));
    if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
      console_->print(F(" session="));
      console_->print(config_.elechouseSessionCode);
      console_->print(F(" connected="));
      console_->print(tcpClient_.connected() ? F("yes") : F("no"));
      console_->print(F(" brokerOk="));
      console_->print(elechouseBrokerOk_ ? F("yes") : F("no"));
    }
    console_->println();
    return;
  }

  if (sub == "off") {
    config_.tcpMode = NetworkRfidTcpMode::Off;
    console_->println(F("OK tcp off"));
    if (console_ == &tcpClient_ || console_ == &serverClient_) {
      console_->flush();
      delay(20);
    }
    restartTcpSocket();
    return;
  }

  if (sub == "elechouse" || sub == "eh" || sub == "broker" || sub == "test") {
    String code = nextToken(rest);
    code.trim();
    if (code.length() == 0 && config_.elechouseSessionCode.length() == 0) {
      console_->println(F("ERR tcp elechouse <session_code>"));
      return;
    }
    if (code.length() > 0) {
      if (!isValidElechouseSessionCode(code)) {
        console_->println(F("ERR session code chars: A-Z a-z 0-9 _ . : - max64"));
        return;
      }
      config_.elechouseSessionCode = code;
    }
    config_.tcpMode = NetworkRfidTcpMode::ElechouseTest;
    config_.tcpEchoEvents = true;
    config_.tcpCommands = true;
    console_->println(F("OK tcp elechouse"));
    if (console_ == &tcpClient_ || console_ == &serverClient_) {
      console_->flush();
      delay(20);
    }
    restartTcpSocket();
    return;
  }

  if (sub == "client") {
    const String host = nextToken(rest);
    const uint16_t port = static_cast<uint16_t>(nextToken(rest).toInt());
    if (host.length() == 0 || port == 0) {
      console_->println(F("ERR tcp client <host> <port>"));
      return;
    }
    config_.tcpMode = NetworkRfidTcpMode::Client;
    config_.tcpHost = host;
    config_.tcpPort = port;
    console_->println(F("OK tcp client"));
    if (console_ == &tcpClient_ || console_ == &serverClient_) {
      console_->flush();
      delay(20);
    }
    restartTcpSocket();
    return;
  }

  if (sub == "server") {
    const uint16_t port = static_cast<uint16_t>(nextToken(rest).toInt());
    if (port == 0) {
      console_->println(F("ERR tcp server <port>"));
      return;
    }
    config_.tcpMode = NetworkRfidTcpMode::Server;
    config_.tcpListenPort = port;
    console_->println(F("OK tcp server"));
    if (console_ == &tcpClient_ || console_ == &serverClient_) {
      console_->flush();
      delay(20);
    }
    restartTcpSocket();
    return;
  }

  if (sub == "echo") {
    const String value = lowerCopy(nextToken(rest));
    if (value != "on" && value != "off") {
      console_->println(F("ERR tcp echo on|off"));
      return;
    }
    config_.tcpEchoEvents = value == "on";
    console_->println(F("OK tcp echo updated"));
    return;
  }

  if (sub == "commands" || sub == "cmd") {
    const String value = lowerCopy(nextToken(rest));
    if (value != "on" && value != "off") {
      console_->println(F("ERR tcp commands on|off"));
      return;
    }
    config_.tcpCommands = value == "on";
    console_->println(F("OK tcp commands updated"));
    return;
  }

  console_->println(F("ERR tcp off|client|server|elechouse <session>|echo|commands|status"));
}

void NetworkRfidReader::handleElechouseCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("elechouse host="));
    console_->print(kElechouseBrokerHost);
    console_->print(F(" port="));
    console_->print(kElechouseBrokerPort);
    console_->print(F(" session="));
    console_->print(config_.elechouseSessionCode);
    console_->print(F(" mode="));
    console_->print(tcpModeName(config_.tcpMode));
    console_->print(F(" connected="));
    console_->print(tcpClient_.connected() ? F("yes") : F("no"));
    console_->print(F(" brokerOk="));
    console_->println(elechouseBrokerOk_ ? F("yes") : F("no"));
    return;
  }

  if (sub == "code" || sub == "session") {
    String code = nextToken(rest);
    code.trim();
    if (lowerCopy(code) == "clear" || lowerCopy(code) == "off" || lowerCopy(code) == "none") {
      config_.elechouseSessionCode = "";
      elechouseBrokerOk_ = false;
      console_->println(F("OK elechouse code cleared"));
      return;
    }
    if (!isValidElechouseSessionCode(code)) {
      console_->println(F("ERR elechouse code <session_code|clear>, chars A-Z a-z 0-9 _ . : - max64"));
      return;
    }
    config_.elechouseSessionCode = code;
    console_->println(F("OK elechouse code updated"));
    return;
  }

