wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  if (sub == "on" || sub == "start" || sub == "connect") {
    String code = nextToken(rest);
    code.trim();
    if (code.length() > 0) {
      if (!isValidElechouseSessionCode(code)) {
        console_->println(F("ERR elechouse on <session_code>"));
        return;
      }
      config_.elechouseSessionCode = code;
    }
    if (config_.elechouseSessionCode.length() == 0) {
      console_->println(F("ERR elechouse code is empty"));
      return;
    }
    config_.tcpMode = NetworkRfidTcpMode::ElechouseTest;
    config_.tcpEchoEvents = true;
    config_.tcpCommands = true;
    console_->println(F("OK elechouse test on"));
    if (console_ == &tcpClient_) {
      console_->flush();
      delay(20);
    }
    restartTcpSocket();
    return;
  }

  if (sub == "off" || sub == "stop") {
    if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
      config_.tcpMode = NetworkRfidTcpMode::Off;
      console_->println(F("OK elechouse test off"));
      if (console_ == &tcpClient_) {
        console_->flush();
        delay(20);
      }
      restartTcpSocket();
    } else {
      console_->println(F("OK elechouse already off"));
    }
    return;
  }

  if (sub == "reconnect" || sub == "retry") {
    if (config_.tcpMode != NetworkRfidTcpMode::ElechouseTest) {
      config_.tcpMode = NetworkRfidTcpMode::ElechouseTest;
    }
    restartTcpSocket();
    ensureTcpClient();
    console_->println(F("OK elechouse reconnecting"));
    return;
  }

  if (isValidElechouseSessionCode(sub)) {
    config_.elechouseSessionCode = sub;
    config_.tcpMode = NetworkRfidTcpMode::ElechouseTest;
    config_.tcpEchoEvents = true;
    config_.tcpCommands = true;
    restartTcpSocket();
    console_->println(F("OK elechouse test on"));
    return;
  }

  console_->println(F("ERR elechouse status|code <session|clear>|on [session]|off|reconnect"));
}

void NetworkRfidReader::handlePortalCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("portal enabled="));
    console_->print(config_.configPortalEnabled ? F("yes") : F("no"));
    console_->print(F(" running="));
    console_->print(portalRunning_ ? F("yes") : F("no"));
    console_->print(F(" ssid="));
    console_->print(config_.configPortalSsid.length() > 0 ? config_.configPortalSsid : defaultPortalSsid());
    console_->print(F(" ip="));
    console_->print(portalRunning_ ? WiFi.softAPIP().toString() : String(F("-")));
    console_->print(F(" port="));
    console_->print(config_.configPortalPort);
    console_->print(F(" timeoutMs="));
    console_->println(portalRunning_ ? String(kPortalAutoRebootMs - (millis() - portalStartMs_)) : String(F("-")));
    return;
  }

  if (sub == "on") {
    config_.configPortalEnabled = true;
    startConfigPortal();
    console_->println(F("OK portal on"));
    return;
  }

  if (sub == "off") {
    config_.configPortalEnabled = false;
    stopConfigPortal();
    if (config_.wifiSsid.length() > 0) {
      restartStation();
    }
    console_->println(F("OK portal off"));
    return;
  }

  if (sub == "ssid") {
    const String ssid = nextToken(rest);
    rest.trim();
    if (ssid.length() == 0) {
      console_->println(F("ERR portal ssid <ssid> [password]"));
      return;
    }
    config_.configPortalSsid = ssid;
    if (rest.length() > 0) {
      config_.configPortalPassword = rest;
    } else {
      config_.configPortalPassword = "";
    }
    console_->println(F("OK portal updated, save and reboot to apply AP name/password"));
    return;
  }

  console_->println(F("ERR portal on|off|status|ssid"));
}

void NetworkRfidReader::handleUartCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("uart mode="));
    console_->print(productInterfaceModeName(config_.productInterfaceMode));
    console_->print(F(" enabled="));
    console_->print(config_.hardwareUartEnabled ? F("yes") : F("no"));
    console_->print(F(" ready="));
    console_->print(hardwareUartReady_ ? F("yes") : F("no"));
    console_->print(F(" baud="));
    console_->print(config_.hardwareUartBaud);
    console_->print(F(" rx="));
    console_->print(config_.pins.hardwareUartRx);
    console_->print(F(" tx="));
    console_->print(config_.pins.hardwareUartTx);
    console_->print(F(" echo="));
    console_->print(config_.hardwareUartEchoEvents ? F("on") : F("off"));
    console_->print(F(" commands="));
    console_->println(config_.hardwareUartCommands ? F("on") : F("off"));
    return;
  }

  if (sub == "on" || sub == "start") {
    const String baud = nextToken(rest);
    if (baud.length() > 0) {
      const uint32_t value = baud.toInt();
      if (value < 1200UL || value > 3000000UL) {
        console_->println(F("ERR uart baud 1200..3000000"));
        return;
      }
      config_.hardwareUartBaud = value;
    }
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Uart;
    config_.hardwareUartEnabled = true;
    const bool command_from_uart = console_ == &hardwareUart_;
    if (command_from_uart) {
      console_->println(F("OK uart on"));
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    if (!command_from_uart) {
      console_->println(F("OK uart on"));
    }
    return;
  }

  if (sub == "off" || sub == "stop") {
    config_.hardwareUartEnabled = false;
    console_->println(F("OK uart off"));
    if (console_ == &hardwareUart_) {
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    return;
  }

  if (sub == "baud" || sub == "speed") {
    const uint32_t baud = nextToken(rest).toInt();
    if (baud < 1200UL || baud > 3000000UL) {
      console_->println(F("ERR uart baud 1200..3000000"));
      return;
    }
    config_.hardwareUartBaud = baud;
    config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Uart;
    const bool command_from_uart = console_ == &hardwareUart_;
    if (command_from_uart) {
      console_->print(F("OK uart baud="));
      console_->println(config_.hardwareUartBaud);
      console_->flush();
      delay(20);
    }
    restartProductInterface();
    if (!command_from_uart) {
      console_->print(F("OK uart baud="));
      console_->println(config_.hardwareUartBaud);
    }
    return;
  }

  if (sub == "pins" || sub == "pin") {
    console_->print(F("UART pins are fixed by board profile: rx="));
    console_->print(config_.pins.hardwareUartRx);
    console_->print(F(" tx="));
    console_->println(config_.pins.hardwareUartTx);
    return;
  }

  if (sub == "echo") {
    const String value = lowerCopy(nextToken(rest));
    if (value != "on" && value != "off") {
      console_->println(F("ERR uart echo on|off"));
      return;
    }
    config_.hardwareUartEchoEvents = value == "on";
    console_->println(F("OK uart echo updated"));
    return;
  }

