wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  if (sub == "wiegand" || sub == "wg") {
    const String action = lowerCopy(nextToken(rest));
    if (action.length() == 0 || action == "on" || action == "start") {
      config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Wiegand;
      config_.hardwareUartEnabled = true;
      const bool command_from_uart = console_ == &hardwareUart_;
      if (command_from_uart) {
        console_->println(F("OK interface mode=wiegand"));
        console_->flush();
        delay(20);
      }
      restartProductInterface();
      if (!command_from_uart) {
        console_->println(F("OK interface mode=wiegand"));
      }
      return;
    }
    if (action == "bits" || action == "bit") {
      const uint8_t bits = static_cast<uint8_t>(nextToken(rest).toInt());
      if (!isSupportedWiegandBits(bits)) {
        console_->println(F("ERR wiegand bits 26|34|37|56"));
        return;
      }
      config_.wiegandBits = bits;
      console_->print(F("OK wiegand bits="));
      console_->println(config_.wiegandBits);
      return;
    }
    if (action == "status") {
      rest = F("status");
      handleInterfaceCommand(rest);
      return;
    }
    console_->println(F("ERR interface wiegand [on]|bits <26|34|37|56>|status"));
    return;
  }

  if (sub == "aba" || sub == "clockdata" || sub == "clock-data") {
    const String action = lowerCopy(nextToken(rest));
    if (action.length() == 0 || action == "on" || action == "start") {
      config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Aba;
      config_.hardwareUartEnabled = true;
      const bool command_from_uart = console_ == &hardwareUart_;
      if (command_from_uart) {
        console_->println(F("OK interface mode=aba"));
        console_->flush();
        delay(20);
      }
      restartProductInterface();
      if (!command_from_uart) {
        console_->println(F("OK interface mode=aba"));
      }
      return;
    }
    if (action == "digits") {
      const uint32_t digits = nextToken(rest).toInt();
      if (digits > 32) {
        console_->println(F("ERR aba digits 0..32"));
        return;
      }
      config_.abaDigits = static_cast<uint8_t>(digits);
      console_->print(F("OK aba digits="));
      if (config_.abaDigits == 0) {
        console_->println(F("auto"));
      } else {
        console_->println(config_.abaDigits);
      }
      return;
    }
    if (action == "source") {
      const String source = lowerCopy(nextToken(rest));
      if (source == "raw") {
        config_.abaUseCardNumber = false;
      } else if (source == "cn" || source == "card" || source == "cardnumber") {
        config_.abaUseCardNumber = true;
      } else {
        console_->println(F("ERR aba source raw|cn"));
        return;
      }
      console_->print(F("OK aba source="));
      console_->println(config_.abaUseCardNumber ? F("cn") : F("raw"));
      return;
    }
    if (action == "status") {
      rest = F("status");
      handleInterfaceCommand(rest);
      return;
    }
    console_->println(F("ERR interface aba [on]|digits <0..32>|source raw|cn|status"));
    return;
  }

  console_->println(F("ERR interface status|mode uart|wiegand|aba|on|off|events on|off|commands on|off|baud <baud>|pulse <us> <gap_us>|wiegand bits <bits>|aba digits <n>|aba source raw|cn"));
}

void NetworkRfidReader::handleFeedbackCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("feedback enabled="));
    console_->print(config_.feedbackEnabled ? F("yes") : F("no"));
    console_->print(F(" led="));
    console_->print(config_.pins.feedbackLed);
    console_->print(F(" buzzer="));
    console_->print(config_.pins.feedbackBuzzer);
    console_->print(F(" buzzerHz="));
    console_->print(config_.feedbackBuzzerHz);
    console_->print(F(" buzzerMs="));
    console_->print(config_.feedbackBuzzerMs);
    console_->print(F(" successMs="));
    console_->println(config_.feedbackSuccessMs);
    return;
  }

  if (sub == "on") {
    config_.feedbackEnabled = true;
    setupFeedback();
    console_->println(F("OK feedback on"));
    return;
  }
  if (sub == "off") {
    config_.feedbackEnabled = false;
    stopFeedbackBuzzer();
    setFeedbackLed(0, 0, 0);
    console_->println(F("OK feedback off"));
    return;
  }
  if (sub == "led") {
    console_->print(F("Feedback LED pin is fixed by board profile: "));
    console_->println(config_.pins.feedbackLed);
    return;
  }
  if (sub == "buzzer") {
    const uint32_t hz = nextToken(rest).toInt();
    const uint32_t ms = nextToken(rest).toInt();
    if (hz < 100UL || hz > 20000UL || ms > 5000UL) {
      console_->println(F("ERR feedback buzzer <100..20000_hz> <0..5000_ms>"));
      return;
    }
    config_.feedbackBuzzerHz = hz;
    config_.feedbackBuzzerMs = static_cast<uint16_t>(ms);
    console_->println(F("OK feedback buzzer updated"));
    return;
  }
  if (sub == "success_ms") {
    const uint32_t ms = nextToken(rest).toInt();
    if (ms > 60000UL) {
      console_->println(F("ERR feedback success_ms <0..60000>"));
      return;
    }
    config_.feedbackSuccessMs = static_cast<uint16_t>(ms);
    console_->println(F("OK feedback success_ms updated"));
    return;
  }
  if (sub == "idle" || sub == "success") {
    const uint32_t red = nextToken(rest).toInt();
    const uint32_t green = nextToken(rest).toInt();
    const uint32_t blue = nextToken(rest).toInt();
    if (red > 65535UL || green > 65535UL || blue > 65535UL) {
      console_->println(F("ERR feedback idle|success <r16> <g16> <b16>"));
      return;
    }
    if (sub == "idle") {
      config_.feedbackIdleRed = static_cast<uint16_t>(red);
      config_.feedbackIdleGreen = static_cast<uint16_t>(green);
      config_.feedbackIdleBlue = static_cast<uint16_t>(blue);
      showFeedbackIdle();
    } else {
      config_.feedbackSuccessRed = static_cast<uint16_t>(red);
      config_.feedbackSuccessGreen = static_cast<uint16_t>(green);
      config_.feedbackSuccessBlue = static_cast<uint16_t>(blue);
    }
    console_->println(F("OK feedback color updated"));
    return;
  }
  if (sub == "test") {
    triggerFeedbackSuccess();
    console_->println(F("OK feedback test"));
    return;
  }

  console_->println(F("ERR feedback status|on|off|buzzer <hz> <ms>|success_ms <ms>|idle <r> <g> <b>|success <r> <g> <b>|test"));
}

void NetworkRfidReader::handleButtonCommand(String rest) {
  const String sub = lowerCopy(nextToken(rest));
  if (sub.length() == 0 || sub == "status") {
    console_->print(F("button enabled="));
    console_->print(config_.configButtonEnabled ? F("yes") : F("no"));
    console_->print(F(" pin="));
    console_->print(config_.pins.configButton);
    console_->print(F(" activeLow="));
    console_->print(config_.pins.configButtonActiveLow ? F("yes") : F("no"));
    console_->print(F(" pressed="));
    console_->print(readConfigButtonPressed() ? F("yes") : F("no"));
    console_->print(F(" wifiMs="));
    console_->print(config_.buttonWifiConfigMs);
    console_->print(F(" resetMs="));
    console_->println(config_.buttonFactoryResetMs);
    return;
  }

  if (sub == "on") {
    config_.configButtonEnabled = true;
    setupButton();
    console_->println(F("OK button on"));
    return;
  }
  if (sub == "off") {
    config_.configButtonEnabled = false;
    setupButton();
    console_->println(F("OK button off"));
    return;
  }
  if (sub == "pin") {
    console_->print(F("Button pin is fixed by board profile: "));
    console_->println(config_.pins.configButton);
    return;
  }
  if (sub == "active_low") {
    console_->print(F("Button polarity is fixed by board profile: "));
    console_->println(config_.pins.configButtonActiveLow ? F("active-low") : F("active-high"));
    return;
  }
  if (sub == "timing" || sub == "timings") {
    const uint32_t wifi_ms = nextToken(rest).toInt();
    const uint32_t reset_ms = nextToken(rest).toInt();
    if (wifi_ms < 1000UL || reset_ms <= wifi_ms || reset_ms > 60000UL) {
      console_->println(F("ERR button timing <wifi_ms>=1000..59999 <reset_ms>wifi_ms+1..60000"));
      return;
    }
    config_.buttonWifiConfigMs = static_cast<uint16_t>(wifi_ms);
    config_.buttonFactoryResetMs = static_cast<uint16_t>(reset_ms);
    console_->println(F("OK button timing updated"));
    return;
  }

  console_->println(F("ERR button status|on|off|timing <wifi_ms> <reset_ms>"));
}

