wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
void NetworkRfidReader::serviceTcpCommands() {
  if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
    serviceElechouseBroker();
    return;
  }

  if (!config_.tcpCommands) {
    return;
  }

  if (config_.tcpMode == NetworkRfidTcpMode::Client && tcpClient_.connected()) {
    handleSerialStream(tcpClient_, tcpClientLine_);
  } else if (config_.tcpMode == NetworkRfidTcpMode::Server && serverClient_.connected()) {
    handleSerialStream(serverClient_, serverClientLine_);
  }
}

void NetworkRfidReader::serviceElechouseBroker() {
  if (config_.tcpMode != NetworkRfidTcpMode::ElechouseTest) {
    return;
  }
  if (!ensureTcpClient()) {
    return;
  }

  while (tcpClient_.available() > 0) {
    const int value = tcpClient_.read();
    if (value < 0) {
      return;
    }
    const char c = static_cast<char>(value);
    if (c == '\r' || c == '\n') {
      tcpClientLine_.trim();
      if (tcpClientLine_.length() > 0) {
        const bool handled = handleElechouseBrokerLine(tcpClientLine_);
        if (!handled && config_.tcpCommands) {
          Stream* previous_console = console_;
          console_ = &tcpClient_;
          handleCommand(tcpClientLine_);
          console_ = previous_console;
        }
      }
      tcpClientLine_ = "";
    } else if (c >= 32 && c <= 126) {
      if (tcpClientLine_.length() < 220) {
        tcpClientLine_ += c;
      } else {
        tcpClientLine_ = "";
      }
    }
  }

  if (elechouseBrokerOk_ && (millis() - elechouseLastPingMs_) >= kElechouseHeartbeatMs) {
    tcpClient_.print(F("PING\n"));
    elechouseLastPingMs_ = millis();
  }
}

bool NetworkRfidReader::handleElechouseBrokerLine(const String& line) {
  if (!elechouseBrokerOk_) {
    if (line.startsWith("OK ")) {
      elechouseBrokerOk_ = true;
      elechouseLastPingMs_ = millis();
      if (console_ != nullptr) {
        console_->print(F("ELECHOUSE broker "));
        console_->println(line);
      }
      return true;
    }
    if (line.startsWith("ERR ")) {
      if (console_ != nullptr) {
        console_->print(F("ELECHOUSE broker "));
        console_->println(line);
      }
      tcpClient_.stop();
      elechouseHelloSent_ = false;
      elechouseBrokerOk_ = false;
      return true;
    }
    return true;
  }

  if (line == "PONG" || line.startsWith("OK ")) {
    return true;
  }
  if (line == "PING") {
    tcpClient_.print(F("PONG\n"));
    return true;
  }
  return false;
}

void NetworkRfidReader::sendElechouseHello() {
  if (!tcpClient_.connected() || config_.elechouseSessionCode.length() == 0) {
    return;
  }
  String hello = F("HELLO ");
  hello += config_.elechouseSessionCode;
  hello += ' ';
  hello += elechouseDeviceId();
  hello += '\n';
  tcpClient_.print(hello);
  elechouseHelloSent_ = true;
  elechouseBrokerOk_ = false;
  elechouseLastPingMs_ = millis();
}

void NetworkRfidReader::sendElechouseCard(const RfidCardEvent& event) {
  if (config_.tcpMode != NetworkRfidTcpMode::ElechouseTest || !config_.tcpEchoEvents) {
    return;
  }
  if (ensureTcpClient() && elechouseBrokerOk_) {
    tcpClient_.print(formatElechouseCardEvent(event));
  }
}

String NetworkRfidReader::formatElechouseCardEvent(const RfidCardEvent& event) const {
  String line = F("{\"type\":\"card\",\"band\":\"");
  line += jsonEscape(event.band);
  line += F("\",\"card_type\":\"");
  line += jsonEscape(event.type);
  line += F("\",\"uid\":\"");
  line += jsonEscape(event.id);
  line += F("\",\"ms\":");
  line += String(event.ms);
  line += F("}\n");
  return line;
}

String NetworkRfidReader::elechouseDeviceId() const {
  String id = NETWORK_RFID_WIFI_HOSTNAME;
  id += '-';
  id += WiFi.macAddress();
  return id;
}

void NetworkRfidReader::setupFeedback() {
  feedbackLedReady_ = false;
  feedbackBuzzerActive_ = false;
  feedbackShowingSuccess_ = false;
  feedbackBuzzerStopMs_ = 0;
  feedbackSuccessUntilMs_ = 0;

  if (config_.pins.feedbackBuzzer >= 0) {
    pinMode(config_.pins.feedbackBuzzer, OUTPUT);
    digitalWrite(config_.pins.feedbackBuzzer, LOW);
  }

  if (config_.pins.feedbackLed >= 0) {
#if NETWORK_RFID_HAS_RMT
    feedbackLedReady_ = rmtInit(config_.pins.feedbackLed, RMT_TX_MODE, RMT_MEM_NUM_BLOCKS_1, kWs2816RmtHz);
    if (feedbackLedReady_) {
      rmtSetEOT(config_.pins.feedbackLed, LOW);
    } else if (console_ != nullptr) {
      console_->println(F("ERR feedback LED RMT init failed"));
    }
#else
    if (console_ != nullptr) {
      console_->println(F("ERR feedback LED requires Arduino ESP32 core 3 RMT"));
    }
#endif
  }

  if (config_.feedbackEnabled) {
    showFeedbackIdle();
  } else {
    setFeedbackLed(0, 0, 0);
  }
}

void NetworkRfidReader::serviceFeedback() {
  const uint32_t now = millis();
  if (feedbackBuzzerActive_ && static_cast<int32_t>(now - feedbackBuzzerStopMs_) >= 0) {
    stopFeedbackBuzzer();
  }
  if (feedbackShowingSuccess_ && static_cast<int32_t>(now - feedbackSuccessUntilMs_) >= 0) {
    feedbackShowingSuccess_ = false;
    showFeedbackIdle();
  }
}

void NetworkRfidReader::triggerFeedbackSuccess() {
  if (!config_.feedbackEnabled) {
    return;
  }

  feedbackShowingSuccess_ = true;
  feedbackSuccessUntilMs_ = millis() + config_.feedbackSuccessMs;
  setFeedbackLed(config_.feedbackSuccessRed, config_.feedbackSuccessGreen, config_.feedbackSuccessBlue);
  startFeedbackBuzzer();
}

void NetworkRfidReader::showFeedbackIdle() {
  if (!config_.feedbackEnabled) {
    return;
  }
  setFeedbackLed(config_.feedbackIdleRed, config_.feedbackIdleGreen, config_.feedbackIdleBlue);
}

void NetworkRfidReader::setFeedbackLed(uint16_t red, uint16_t green, uint16_t blue) {
#if NETWORK_RFID_HAS_RMT
  if (!feedbackLedReady_ || config_.pins.feedbackLed < 0) {
    return;
  }

  rmt_data_t symbols[kWs2816BitsPerPixel] = {};
  size_t index = 0;
  appendWs2816Word(symbols, index, green);
  appendWs2816Word(symbols, index, red);
  appendWs2816Word(symbols, index, blue);
  if (!rmtWrite(config_.pins.feedbackLed, symbols, index, RMT_WAIT_FOR_EVER) && console_ != nullptr) {
    console_->println(F("ERR feedback LED write failed"));
  }
  delayMicroseconds(300);
#else
  (void)red;
  (void)green;
  (void)blue;
#endif
}

