wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
void NetworkRfidReader::startFeedbackBuzzer() {
  if (!config_.feedbackEnabled || config_.pins.feedbackBuzzer < 0 || config_.feedbackBuzzerMs == 0) {
    return;
  }

  feedbackBuzzerStopMs_ = millis() + config_.feedbackBuzzerMs;
  if (feedbackBuzzerActive_) {
    return;
  }

  const uint32_t hz = config_.feedbackBuzzerHz == 0 ? 2700UL : config_.feedbackBuzzerHz;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  if (!ledcAttach(config_.pins.feedbackBuzzer, hz, 8)) {
    if (console_ != nullptr) {
      console_->println(F("ERR feedback buzzer ledcAttach failed"));
    }
    return;
  }
  ledcWrite(config_.pins.feedbackBuzzer, 128);
#else
  ledcSetup(config_.pins.feedbackBuzzerLedcChannel, hz, 8);
  ledcAttachPin(config_.pins.feedbackBuzzer, config_.pins.feedbackBuzzerLedcChannel);
  ledcWrite(config_.pins.feedbackBuzzerLedcChannel, 128);
#endif
  feedbackBuzzerActive_ = true;
}

void NetworkRfidReader::stopFeedbackBuzzer() {
  if (config_.pins.feedbackBuzzer < 0) {
    feedbackBuzzerActive_ = false;
    return;
  }

  if (feedbackBuzzerActive_) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(config_.pins.feedbackBuzzer, 0);
    ledcDetach(config_.pins.feedbackBuzzer);
#else
    ledcWrite(config_.pins.feedbackBuzzerLedcChannel, 0);
    ledcDetachPin(config_.pins.feedbackBuzzer);
#endif
  }
  pinMode(config_.pins.feedbackBuzzer, OUTPUT);
  digitalWrite(config_.pins.feedbackBuzzer, LOW);
  feedbackBuzzerActive_ = false;
}

void NetworkRfidReader::beepFeedback(uint8_t count) {
  if (!config_.feedbackEnabled ||
      config_.pins.feedbackBuzzer < 0 ||
      config_.feedbackBuzzerMs == 0 ||
      count == 0) {
    return;
  }

  for (uint8_t i = 0; i < count; i++) {
    stopFeedbackBuzzer();
    startFeedbackBuzzer();
    delay(config_.feedbackBuzzerMs);
    stopFeedbackBuzzer();
    if ((i + 1U) < count) {
      delay(kButtonBeepGapMs);
    }
  }
}

void NetworkRfidReader::setupButton() {
  buttonLastRawPressed_ = false;
  buttonStablePressed_ = false;
  buttonWifiConfigFired_ = false;
  buttonFactoryResetFired_ = false;
  buttonLastRawChangeMs_ = millis();
  buttonPressStartMs_ = 0;

  if (!config_.configButtonEnabled || config_.pins.configButton < 0) {
    return;
  }

  pinMode(config_.pins.configButton, config_.pins.configButtonActiveLow ? INPUT_PULLUP : INPUT);
  buttonLastRawPressed_ = readConfigButtonPressed();
  buttonStablePressed_ = buttonLastRawPressed_;
  if (buttonStablePressed_) {
    buttonPressStartMs_ = millis();
  }
}

void NetworkRfidReader::serviceButton() {
  if (!config_.configButtonEnabled || config_.pins.configButton < 0) {
    return;
  }

  const uint32_t now = millis();
  const bool raw_pressed = readConfigButtonPressed();
  if (raw_pressed != buttonLastRawPressed_) {
    buttonLastRawPressed_ = raw_pressed;
    buttonLastRawChangeMs_ = now;
    return;
  }
  if ((now - buttonLastRawChangeMs_) < kButtonDebounceMs) {
    return;
  }

  if (raw_pressed != buttonStablePressed_) {
    buttonStablePressed_ = raw_pressed;
    if (buttonStablePressed_) {
      buttonPressStartMs_ = now;
      buttonWifiConfigFired_ = false;
      buttonFactoryResetFired_ = false;
    } else {
      buttonPressStartMs_ = 0;
      buttonWifiConfigFired_ = false;
      buttonFactoryResetFired_ = false;
    }
  }

  if (!buttonStablePressed_ || buttonPressStartMs_ == 0) {
    return;
  }

  const uint32_t held_ms = now - buttonPressStartMs_;
  if (!buttonWifiConfigFired_ && held_ms >= config_.buttonWifiConfigMs) {
    buttonWifiConfigFired_ = true;
    beepFeedback(1);
    enterDefaultWifiConfig();
  }
  if (!buttonFactoryResetFired_ && held_ms >= config_.buttonFactoryResetMs) {
    buttonFactoryResetFired_ = true;
    beepFeedback(2);
    restoreDefaultConfig();
  }
}

bool NetworkRfidReader::readConfigButtonPressed() const {
  if (!config_.configButtonEnabled || config_.pins.configButton < 0) {
    return false;
  }
  const int level = digitalRead(config_.pins.configButton);
  return config_.pins.configButtonActiveLow ? (level == LOW) : (level == HIGH);
}

void NetworkRfidReader::enterDefaultWifiConfig() {
  config_.configPortalEnabled = true;
  config_.configPortalSsid = "";
  config_.configPortalPassword = "";
  config_.configPortalPort = 80;

  if (portalRunning_) {
    stopConfigPortal();
  }
  startConfigPortal();

  if (console_ != nullptr) {
    console_->println(F("BUTTON wifi config portal: SSID=ELECHOUSE_RFID IP=10.10.10.10"));
  }
}

void NetworkRfidReader::restoreDefaultConfig() {
  if (console_ != nullptr) {
    console_->println(F("BUTTON factory reset: clearing saved config and rebooting"));
  }
  clearSavedConfig();
  delay(150);
  ESP.restart();
}

void NetworkRfidReader::setupHardwareUart() {
  releaseHardwareUart();
  hardwareUartLine_ = "";

  if (!config_.hardwareUartEnabled ||
      config_.productInterfaceMode != NetworkRfidProductInterfaceMode::Uart ||
      (config_.pins.hardwareUartRx < 0 && config_.pins.hardwareUartTx < 0)) {
    return;
  }

  const uint32_t baud = config_.hardwareUartBaud == 0 ? 115200UL : config_.hardwareUartBaud;
  hardwareUart_.begin(baud, SERIAL_8N1,
                      static_cast<int8_t>(config_.pins.hardwareUartRx),
                      static_cast<int8_t>(config_.pins.hardwareUartTx));
  hardwareUartReady_ = true;

  if (console_ != nullptr) {
    console_->print(F("UART1 ready baud="));
    console_->print(baud);
    console_->print(F(" rx="));
    console_->print(config_.pins.hardwareUartRx);
    console_->print(F(" tx="));
    console_->println(config_.pins.hardwareUartTx);
  }
}

void NetworkRfidReader::releaseHardwareUart() {
  if (hardwareUartReady_) {
    hardwareUart_.flush();
    hardwareUart_.end();
  }
  hardwareUartReady_ = false;
  hardwareUartLine_ = "";
}

void NetworkRfidReader::restartHardwareUart() {
  config_.productInterfaceMode = NetworkRfidProductInterfaceMode::Uart;
  restartProductInterface();
}

void NetworkRfidReader::setupProductInterface() {
  releaseProductInterface();

  if (!config_.hardwareUartEnabled) {
    return;
  }

