wilson-elechouse/network_RFID/ESP32S3_LF_HF_Network_RFID/src/NetworkRfidReader.cpp
  lastEventKey_ = key;
  lastEventMs_ = event.ms;

  if (config_.duplicateSuppressMs == 0) {
    return false;
  }

  for (size_t i = 0; i < DuplicateCacheSize; i++) {
    if (duplicateKeys_[i] == key) {
      if ((event.ms - duplicateMs_[i]) < config_.duplicateSuppressMs) {
        return true;
      }
      duplicateMs_[i] = event.ms;
      return false;
    }
  }

  duplicateKeys_[duplicateNext_] = key;
  duplicateMs_[duplicateNext_] = event.ms;
  duplicateNext_ = (duplicateNext_ + 1U) % DuplicateCacheSize;
  return false;
}

String NetworkRfidReader::formatEvent(const RfidCardEvent& event) const {
  if (config_.outputFormat == NetworkRfidOutputFormat::CsvLine) {
    String line = event.band;
    line += ',';
    line += event.type;
    line += ',';
    line += event.id;
    line += ',';
    line += String(event.ms);
    line += '\n';
    return line;
  }

  String line = F("{\"band\":\"");
  line += jsonEscape(event.band);
  line += F("\",\"type\":\"");
  line += jsonEscape(event.type);
  line += F("\",\"id\":\"");
  line += jsonEscape(event.id);
  line += F("\",\"ms\":");
  line += String(event.ms);
  line += F("}\n");
  return line;
}

void NetworkRfidReader::printHelp() {
  if (console_ == nullptr) {
    return;
  }
  console_->println();
  console_->println(F("ESP32S3 LF/HF Network RFID"));
  console_->println(F("Commands:"));
  console_->println(F("  help | status | pins"));
  console_->println(F("  wifi [status] | wifi scan [ssid] | wifi <ssid> <password> | wifi reconnect | wifi off"));
  console_->println(F("  tcp client <host> <port> | tcp server <port> | tcp elechouse <session> | tcp off | tcp echo on|off | tcp commands on|off | tcp status"));
  console_->println(F("  elechouse status|code <session|clear>|on [session]|off|reconnect"));
  console_->println(F("  uart status|on [baud]|off|baud <baud>|echo on|off|commands on|off"));
  console_->println(F("  interface status|mode uart|wiegand|aba|on|off|events on|off|commands on|off|baud <baud>"));
  console_->println(F("  interface pulse <us> <gap_us> | wiegand bits <26|34|37|56> | aba digits <0..32> | aba source raw|cn"));
  console_->println(F("  feedback status|on|off|buzzer <hz> <ms>|success_ms <ms>|idle <r> <g> <b>|success <r> <g> <b>|test"));
  console_->println(F("  button status|on|off|timing <wifi_ms> <reset_ms>"));
  console_->println(F("  portal on|off|status|ssid <ssid> [password]"));
  console_->println(F("  lf init | lf off | lf status | lf freq <hz> | lf scan [start stop step ms]"));
  console_->println(F("  lf raw <count> | lf hid [ms] | lf indala [samples]"));
  console_->println(F("  hf probe | hf speed <hz> | hf init | hf off | hf status"));
  console_->println(F("  hf mode scan|card | hf tech a|b|f|v on|off"));
  console_->println(F("  hf card on [uid]|off|uid <hex>|ndef url|text|vcard|wifi <payload>|status"));
  console_->println(F("  format json|line"));
  console_->println(F("  window <lf_ms> <hf_ms>"));
  console_->println(F("  dedupe <ms>"));
  console_->println(F("  auto lf|hf on|off"));
  console_->println(F("  pins"));
  console_->println(F("  save | load | clear | reboot | test"));
}

void NetworkRfidReader::printStatus() {
  if (console_ == nullptr) {
    return;
  }

  uint32_t captured = 0;
  uint32_t dropped = 0;
  noInterrupts();
  captured = capturedPulses_;
  dropped = droppedPulses_;
  interrupts();

  console_->print(F("slot="));
  console_->print(slotName(activeSlot_));
  console_->print(F(" hfBus="));
  console_->print(hfBusModeName(config_.pins.hfBusMode));
  console_->print(F(" hfRole="));
  console_->print(hfRoleName(config_.hfRole));
  console_->print(F(" hfReady="));
  console_->print(hfReady_ ? F("yes") : F("no"));
  console_->print(F(" lfCarrier="));
  console_->print(lfCarrierEnabled_ ? F("on") : F("off"));
  console_->print(F(" lfCapture="));
  console_->print(lfCaptureEnabled_ ? F("on") : F("off"));
  console_->print(F(" pulses="));
  console_->print(captured);
  console_->print(F(" dropped="));
  console_->println(dropped);

  console_->print(F("wifi="));
  if (WiFi.status() == WL_CONNECTED) {
    console_->print(WiFi.localIP().toString());
  } else {
    console_->print(wifiStatusName(WiFi.status()));
    console_->print(F("("));
    console_->print(static_cast<int>(WiFi.status()));
    console_->print(F(")"));
  }
  console_->print(F(" tcp="));
  console_->print(tcpModeName(config_.tcpMode));
  console_->print(F(" tcpEcho="));
  console_->print(config_.tcpEchoEvents ? F("on") : F("off"));
  console_->print(F(" tcpCommands="));
  console_->print(config_.tcpCommands ? F("on") : F("off"));
  console_->print(F(" clientConnected="));
  console_->print(tcpClient_.connected() ? F("yes") : F("no"));
  console_->print(F(" serverClient="));
  console_->print(serverClient_.connected() ? F("yes") : F("no"));
  if (config_.tcpMode == NetworkRfidTcpMode::ElechouseTest) {
    console_->print(F(" ehSession="));
    console_->print(config_.elechouseSessionCode);
    console_->print(F(" ehOk="));
    console_->print(elechouseBrokerOk_ ? F("yes") : F("no"));
  }
  console_->println();

  console_->print(F("portal="));
  console_->print(portalRunning_ ? WiFi.softAPIP().toString() : String(F("off")));
  console_->print(F(" ssid="));
  console_->println(config_.configPortalSsid.length() > 0 ? config_.configPortalSsid : defaultPortalSsid());

  console_->print(F("feedback="));
  console_->print(config_.feedbackEnabled ? F("on") : F("off"));
  console_->print(F(" led="));
  console_->print(config_.pins.feedbackLed);
  console_->print(F(" buzzer="));
  console_->print(config_.pins.feedbackBuzzer);
  console_->print(F(" buzzerHz="));
  console_->println(config_.feedbackBuzzerHz);

  console_->print(F("button="));
  console_->print(config_.configButtonEnabled ? F("on") : F("off"));
  console_->print(F(" pin="));
  console_->print(config_.pins.configButton);
  console_->print(F(" pressed="));
  console_->print(readConfigButtonPressed() ? F("yes") : F("no"));
  console_->print(F(" wifiMs="));
  console_->print(config_.buttonWifiConfigMs);
  console_->print(F(" resetMs="));
  console_->println(config_.buttonFactoryResetMs);

